tutorials/cases/charOnlyMoveCases/parallel-recon/constant/reactions


species
(
    N2 H2O CO O2 H2 CO2 CH4 tar 
);


reactions
{
    // Reaction R8 exothermic
    OxidationOfHydrogen
    {
        type     irreversibleArrheniusReaction;
        reaction "2 H2 + O2 = 2 H2O";
        A        2.2e9;
        beta     0;
        Ta       13110.42;
    }

    // Reaction R9 exothermic
    OxidationOfCarbonMonoxide
    {
        type     irreversibleArrheniusReaction;
        reaction "2 CO + O2 = 2 CO2";
        A        1e10;
        beta     0;
        Ta       15155.16;
    }

    // Reaction R10 exothermic
    OxidationOfMethane
    {
        type     irreversibleArrheniusReaction;
        reaction "CH4 + 1.5 O2 = CO + 2 H2O";
        A        4.4e11;
        beta     0;
        Ta       15155.16;
    }

    // Reaction R11 endothermic
    SteamReformingReaction
    {
        type     irreversibleArrheniusReaction;
        reaction "CH4 + H2O = CO + 3 H2";
        A        3e8;
        beta     0;
        Ta       15034.88;
    }

    // Reaction R12 endothermic
    SteamReformingReaction2
    {
        type     irreversibleArrheniusReaction;
        reaction "CH4 + 0.5 O2 = CO + 2 H2";
        A        4.996e13;
        beta     0;
        Ta       24368.535;
    }

    // Reaction R13 exothermic    
    WaterGasShiftReaction
    {
        type     irreversibleArrheniusReaction;
        reaction "CO + H2O = CO2 + H2";
        A        2.35e10;
        beta     0;
        Ta       34640.4;
    }

    // Reaction R14 exothermic    
    tarCracking
    {
        type     irreversibleArrheniusReaction;
        reaction "tar + 3 O2 = 6 CO + 3 H2";
        A        1.58e15;
        beta     0;
        Ta       24368.535;
    }
};
